<?php namespace App\Http\Controllers\ApiV2;

use Illuminate\Foundation\Auth\SendsPasswordResetEmails;
use App\Product;
use App\Category;

class ProductController extends BaseAuthController
{
    public function index() {
        return 'products';
    }

    public function init() {
        $categories = [
            '燒味飯類'=>[
                ['發財三寶飯',90],
                ['金牌滷味飯',90],
                ['脆皮燒鴨飯',80],
                ['花雕油雞飯',80],
                ['化皮燒肉飯',80],
                ['蜜汁叉燒飯',80],
                ['叉燒拼鴨飯',85],
                ['叉燒拼雞飯',85],
                ['燒肉拼鴨飯',85],
                ['燒肉拼雞飯',85],
                ['油雞拼鴨飯',85],
                ['蜜汁雞腿飯',85],
                ['油雞腿飯',85],
                ['鴨腿飯',100],
                ['臘味飯',100]
            ],
            '港式粥品'=>[
                ['發財及第粥',80],
                ['皮蛋瘦肉粥',80],
                ['皮蛋魚片粥',80],
                ['皮蛋豬肝粥',80],
                ['鮮牛肉片粥',80],
                ['生菜火鴨粥',80],
                ['豬肝瘦肉粥',80],
                ['沙田滑雞粥',80],
                ['海鮮粥',100],
                ['蝦球粥',100],
                ['鮑魚滑雞粥',180]
            ],
            '炒燴飯類'=>[
                ['廣州炒飯',120],
                ['星州炒飯',120],
                ['蝦仁炒飯',120],
                ['臘味炒飯',120],
                ['茄汁炒飯',120],
                ['生炒牛肉飯',120],
                ['鹹魚雞粒炒飯',120],
                ['蝦仁燴飯',120],
                ['牛腩燴飯',120],
                ['時菜生肉飯',120],
                ['時菜肉片飯',120],
                ['香菇肉片飯',120],
                ['香菇滑雞飯',120],
                ['滑蛋牛肉飯',120],
                ['滑蛋叉燒飯',120],
                ['滑蛋蝦仁飯',120],
                ['滑蛋肉片飯',120],
                ['玉米肉片飯',120],
                ['玉米蝦仁飯',120],
                ['玉米牛肉飯',120],
                ['玉米雞粒飯',120],
                ['咖喱雞飯',120],
                ['咖喱牛肉飯',120],
                ['咖喱牛腩飯',120],
                ['鮮魚片燴飯',120],
                ['麻婆豆腐飯',120],
                ['豆腐火腩飯',120],
                ['蝦球燴飯',150],
                ['鮑魚燴飯',220]
            ],
            '炒麵類'=>[
                ['干炒牛河',120],
                ['干炒豬肉河',120],
                ['廣州炒麵',120],
                ['海鮮炒麵',120],
                ['牛肉炒麵',120],
                ['肉絲炒麵',120],
                ['星州炒米粉',120],
                ['肉絲炒米粉',120]
            ],
            '精美小菜'=>[
                ['蠔油牛肉',200],
                ['白灼牛肉',200],
                ['芥蘭牛肉',200],
                ['芥蘭臘味',200],
                ['腰困蝦仁',200],
                ['叉燒炒蛋',200],
                ['蝦仁炒蛋',200],
                ['油泡蝦球',200],
                ['原汁牛腩菜',200],
                ['麻婆豆腐',150],
                ['郊外油菜',80]
            ],
            '湯類'=>[
                ['鮮蝦雲吞湯',50],
                ['香茜魚片湯',50],
                ['香菇牛肉湯',50],
                ['雞茸玉米羹',40],
                ['香菇三絲湯',40],
                ['蛋花肉片湯',40],
                ['豬肝湯',40]
            ],
            '各'
        ];
        return 'init';
    }
}